/******************************************
  配列
    魔法陣を表示する。
******************************************/
#include <stdio.h>
enum { N = 3}; //Nは1を除く正の奇数

int main( void) {
  int a[N][N] = {{0}};   //魔法陣はNxNマス
  int y = 0;             //開始は最上段
  int x = (int)(N / 2);  //の中央

  a[y][x] = 1;
  //全てのマスが埋まったらループを抜ける。
  for( int n = 2; n <= N * N; n++) {
    //右上が空か？
    if( a[(y - 1 + N) % N][(x + 1) % N] == 0) {
      //右上に次の数を入れる。
      y = (y - 1 + N) % N;
      x = (x + 1) % N;
      a[y][x] = n;
    } else {
      //下のマスに次の数を入れる。
      y = (y + 1) % N;
      a[y][x] = n;
    }
  }
  //全てのマスを表示する。
  for( int n = 1; n <= N*N; n++) {
    printf("%2d ",a[(int)(n/N)][n%N-1]);
    if(n % N == 0) printf("\n");
  }
 return 0;
}